[{"id":"67899651969374580","title":"The Lightning Thief","imageUrl":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1400602609l/28187.jpg","description":"Percy Jackson is a good kid, but he can't seem to focus on his schoolwork or control his temper. And lately, being away at boarding school is only getting worse—Percy could have sworn his pre-algebra teacher turned into a monster and tried to kill him.\r\nWhen Percy's mom finds out, she knows it's time that he knew the truth about where he came from, and that he go to the one place he'll be safe. She sends Percy to Camp Half Blood, a summer camp for demigods (on Long Island), where he learns that the father he never knew is Poseidon, god of the sea. Soon a mystery unfolds and together with his friends—one a satyr and the other the demigod daughter of Athena—Percy sets out on a quest across the United States to reach the gates of the Underworld (located in a recording studio in Hollywood) and prevent a catastrophic war between the gods.  ","price":"10.99","author":"Rick Riordan  ","isbn":"1234567891234"},{"title":"Harry Potter and the Sorcerer's Stone","imageUrl":"https://prodimage.images-bn.com/pimages/9780590353427_p0_v2_s550x406.jpg","description":"Harry Potter has never been the star of a Quidditch team, scoring points while riding a broom far above the ground. He knows no spells, has never helped to hatch a dragon, and has never worn a cloak of invisibility.\r\n\r\nAll he knows is a miserable life with the Dursleys, his horrible aunt and uncle, and their abominable son, Dudley - a great big swollen spoiled bully. Harry's room is a tiny closet at the foot of the stairs, and he hasn't had a birthday party in eleven years.\r\n\r\nBut all that is about to change when a mysterious letter arrives by owl messenger: a letter with an invitation to an incredible place that Harry - and anyone who reads about him - will find unforgettable.\r\n\r\nFor it's there that he finds not only friends, aerial sports, and magic in everything from classes to meals, but a great destiny that's been waiting for him... if Harry can survive the encounter.\r\n","price":"8.99","author":"J. K. Rowling","isbn":"9780590353427","id":"89570888473027520"},{"title":"The Hunger Games","imageUrl":"https://prodimage.images-bn.com/pimages/9780439023528_p0_v1_s550x406.jpg","description":"Winning means fame and fortune. Losing means certain death. The Hunger Games have begun. . . . In the ruins of a place once known as North America lies the nation of Panem, a shining Capitol surrounded by twelve outlying districts. The Capitol is harsh and cruel and keeps the districts in line by forcing them all to send one boy and one girl between the ages of twelve and eighteen to participate in the annual Hunger Games, a fight to the death on live TV. Sixteen-year-old Katniss Everdeen regards it as a death sentence when she steps forward to take her sister's place in the Games. But Katniss has been close to dead before-and survival, for her, is second nature. Without really meaning to, she becomes a contender. But if she is to win, she will have to start making choices that weigh survival against humanity and life against love.","price":"13","author":"Suzanne Collins","isbn":"9780439023528","id":"60526035855834824"},{"title":"Eragon","imageUrl":"https://prodimage.images-bn.com/pimages/9780375826696_p0_v7_s550x406.jpg","description":"When fifteen-year-old Eragon finds a polished blue stone in the forest, he thinks it is the lucky discovery of a poor farm boy. But when the stone brings a dragon hatchling, Eragon soon realizes he has stumbled upon a legacy nearly as old as the Empire itself.\r\n\r\nOvernight his simple life is shattered, and, gifted with only an ancient sword, a loyal dragon, and sage advice from an old storyteller, Eragon is soon swept into a dangerous tapestry of magic, glory, and power. Now his choices could save—or destroy—the Empire.","price":"11","author":"Christopher Paolini","isbn":"9780375826696","id":"35558818344717790"},{"title":"The Lost Hero","imageUrl":"https://prodimage.images-bn.com/pimages/9781423113393_p0_v2_s550x406.jpg","description":"Jason has a problem. He doesn’t remember anything before waking up on a school bus holding hands with a girl. Apparently she’s his girlfriend Piper, his best friend is a kid named Leo, and they’re all students in the Wilderness School, a boarding school for “bad kids.” What he did to end up here, Jason has no idea—except that everything seems very wrong.\r\n\r\nPiper has a secret. Her father has been missing for three days, and her vivid nightmares reveal that he’s in terrible danger. Now her boyfriend doesn’t recognize her, and when a freak storm and strange creatures attack during a school field trip, she, Jason, and Leo are whisked away to someplace called Camp Half-Blood. What is going on?\r\n\r\nLeo has a way with tools. His new cabin at Camp Half-Blood is filled with them. Seriously, the place beats Wilderness School hands down, with its weapons training, monsters, and fine-looking girls. What’s troubling is the curse everyone keeps talking about, and that a camper’s gone missing. Weirdest of all, his bunkmates insist they are all—including Leo—related to a god. ","price":"18","author":"Rick Riordan","isbn":"9781423113393","id":"6312617547813892"},{"title":"Artemis Fowl ","imageUrl":"https://i.gr-assets.com/images/S/compressed.photo.goodreads.com/books/1327945104l/249747.jpg","description":"Twelve-year-old Artemis Fowl is a millionaire, a genius, and above all, a criminal mastermind. But even Artemis doesn't know what he's taken on when he kidnaps a fairy, Captain Holly Short of the LEPrecon Unit. These aren't the fairies of bedtime stories—they're dangerous! Full of unexpected twists and turns, Artemis Fowl is a riveting, magical adventure.","price":"8","author":"Eoin Colfer","isbn":"9780786817870","id":"3153584180535795.5"},{"title":"The Warrior Heir","imageUrl":"https://prodimage.images-bn.com/pimages/9780786839179_p0_v4_s550x406.jpg","description":"Before he knew about the Roses, 16-year-old Jack lived an unremarkable life in the small Ohio town of Trinity. Only the medicine he has to take daily and the thick scar above his heart set him apart from the other high-schoolers. Then one day Jack skips his medicine. Suddenly, he is stronger, fiercer, and more confident than ever before. And it feels great-until he loses control of his own strength and nearly kills another player during soccer team tryouts.\r\n\r\nSoon, Jack learns the startling truth about himself: He is Weirlind; part of an underground society of magical people who live among us. At the head of this magical society sit the feuding houses of the Red Rose and the White Rose, whose power is determined by playing The Game-a magical tournament in which each house sponsors a warrior to fight to the death. The winning house rules the Weir.\r\n\r\nAs if his bizarre magical heritage isn't enough, Jack finds out that he's not just another member of Weirlind-he's one of the last of the warriors-at a time when both houses are scouting for a player.","price":"7.99","author":"Cinda Williams Chima","isbn":"9780786839179","id":"90255407764290050"}]